In [1]:
import pandas as pd
import numpy as np

In [3]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns= 'a b c d e'.split(),
                     index=['Joao', 'Anna', 'Carlos', 'Wes', 'Travis'])

In [7]:
people.iloc[2:3, [1,2]] = np.nan

In [8]:
people

               a         b         c         d         e
Joao    1.043765 -1.344015 -0.126802  0.407050  2.371361
Anna   -1.354884  1.033199 -0.625616 -1.121579 -0.213733
Carlos -1.247604       NaN       NaN -0.155788 -1.218552
Wes     1.359112 -1.066628 -0.256348 -0.692039 -2.186726
Travis  1.746813 -0.645041 -0.887494 -0.771771 -0.494016

In [13]:
mapping = {'a':'red', 'b':'red', 'c':'blue', 
           'd':'blue', 'e':'red', 'f':'orange'}

In [14]:
by_column = people.groupby(mapping, axis=1)

In [16]:
by_column.sum()

            blue       red
Joao    0.280248  2.071111
Anna   -1.747195 -0.535418
Carlos -0.155788 -2.466155
Wes    -0.948388 -1.894243
Travis -1.659265  0.607757

In [18]:
map_series = pd.Series(mapping)

map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [19]:
people.groupby(map_series, axis=1).count()

        blue  red
Joao       2    3
Anna       2    3
Carlos     1    2
Wes        2    3
Travis     2    3

In [20]:
people

               a         b         c         d         e
Joao    1.043765 -1.344015 -0.126802  0.407050  2.371361
Anna   -1.354884  1.033199 -0.625616 -1.121579 -0.213733
Carlos -1.247604       NaN       NaN -0.155788 -1.218552
Wes     1.359112 -1.066628 -0.256348 -0.692039 -2.186726
Travis  1.746813 -0.645041 -0.887494 -0.771771 -0.494016

# Using functions

In [21]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.359112 -1.066628 -0.256348 -0.692039 -2.186726
4 -0.311119 -0.310815 -0.752418 -0.714529  2.157628
6  0.499209 -0.645041 -0.887494 -0.927559 -1.712567

In [23]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [24]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 two  1.359112 -1.066628 -0.256348 -0.692039 -2.186726
4 one -1.354884 -1.344015 -0.625616 -1.121579 -0.213733
6 one -1.247604       NaN       NaN -0.155788 -1.218552
  two  1.746813 -0.645041 -0.887494 -0.771771 -0.494016